sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_gap_aci.h
 *        - 0x01: Active Scanning
 * @param Scan_Interval Time interval from when the Controller started its last
 *        scan until it begins the subsequent scan on the primary advertising
 *        physical channel.  Time = N * 0.625 ms
 *        Values:
 *        - 0x0004 (2.500 ms)  ... 0xFFFF (40959.375 ms) 
 * @param Scan_Window Time interval from when the Controller started its last
 *        scan until it begins the subsequent scan on the primary advertising
 *        physical channel. Time = N * 0.625 msec.
 *        Values:
 *        - 0x0004 (2.500 ms)  ... 0xFFFF (40959.375 ms) 
 * @retval Value indicating success or error code.
 */
tBleStatus aci_gap_set_scan_configuration(uint8_t Filter_Duplicates,
                                          uint8_t Scanning_Filter_Policy,
                                          uint8_t Scanning_PHY,
                                          uint8_t Scan_Type,
                                          uint16_t Scan_Interval,
                                          uint16_t Scan_Window);
/**
 * @brief This function configures the connection parameters. To configure more
 *        than one PHY, this function must be called more times.
 * @param Initiating_PHY PHY that is going to be configured. Only one bit can be
 *        set.
 *        Flags:
 *        - 0x01: LE_1M_PHY_BIT
 *        - 0x02: LE_2M_PHY_BIT
 *        - 0x04: LE_CODED_PHY_BIT
 * @param Connection_Interval_Min Minimum value for the connection event
 *        interval. This shall be less than or equal to Connection_Interval_Max.
 *        Time = N * 1.25 msec.
 *        Values:
 *        - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms) 
 * @param Connection_Interval_Max Maximum value for the connection event
 *        interval. This shall be greater than or equal to
 *        Connection_Interval_Min. Time = N * 1.25 msec.
 *        Values:
 *        - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms) 
 * @param Max_Latency Maximum Peripheral latency for the connection in number of
 *        connection events.
 *        Values:
 *        - 0x0000 ... 0x01F3
 * @param Supervision_Timeout Supervision timeout for the LE Link. It shall be a
 *        multiple of 10 ms and larger than (1 + connPeripheralLatency) *
 *        connInterval * 2. Time = N * 10 msec.
 *        Values:
 *        - 0x000A (100 ms)  ... 0x0C80 (32000 ms) 
 * @param Min_CE_Length The minimum length of connection event recommended for
 *        this LE connection. Time = N * 0.625 msec.
 * @param Max_CE_Length The maximum length of connection event recommended for
 *        this LE connection. Time = N * 0.625 msec.
 * @retval Value indicating success or error code.
 */
tBleStatus aci_gap_set_connection_configuration(uint8_t Initiating_PHY,
                                                uint16_t Connection_Interval_Min,
                                                uint16_t Connection_Interval_Max,
                                                uint16_t Max_Latency,
                                                uint16_t Supervision_Timeout,
                                                uint16_t Min_CE_Length,
                                                uint16_t Max_CE_Length);
/**
 * @brief Starts a GAP procedure according to the procedure code.
 * @param Procedure_Code Procedure to be started.
 *        Values:
 *        - 0x00: GAP_LIMITED_DISCOVERY_PROC
 *        - 0x01: GAP_GENERAL_DISCOVERY_PROC
 *        - 0x02: GAP_AUTO_CONNECTION_ESTABLISHMENT_PROC
 *        - 0x03: GAP_GENERAL_CONNECTION_ESTABLISHMENT_PROC
 *        - 0x04: GAP_SELECTIVE_CONNECTION_ESTABLISHMENT_PROC
 *        - 0x05: GAP_OBSERVATION_PROC
 * @param PHYs PHYs that will be used for Scanning or Initiating .
 *        Flags:
 *        - 0x01: LE_1M_PHY_BIT
 *        - 0x04: LE_CODED_PHY_BIT
 * @param Duration Ignored. Reserved for future use.
 * @param Period Ignored. Reserved for future use.
 * @retval Value indicating success or error code.
 */
tBleStatus aci_gap_start_procedure(uint8_t Procedure_Code,
                                   uint8_t PHYs,
                                   uint16_t Duration,
                                   uint16_t Period);
/**
 * @brief Creates a direct connection to a device and read the name
 *        characteristic.
 * @param PHYs PHYs that will be used for initiating the connection.
 *        Flags:
 *        - 0x01: LE_1M_PHY_BIT
 *        - 0x04: LE_CODED_PHY_BIT
 * @param Peer_Address_Type The Peer_Address_Type parameter indicates the type
 *        of address used in the connectable advertisement sent by the peer. 0:
 *        Public Device Address or Public Identity Address 1: Random Device
 *        Address or Random (static) Identity Address
 *        Values:
 *        - 0x00: Public Address
 *        - 0x01: Random Address
 * @param Peer_Address Public Device Address, Random Device Address, Public
 *        Identity Address, or Random (static) Identity Address of the device to
 *        be connected.
 * @retval Value indicating success or error code.
 */
tBleStatus aci_gap_discover_name(uint8_t PHYs,
                                 uint8_t Peer_Address_Type,
                                 uint8_t Peer_Address[6]);
/**
 * @brief Add specific device addresses to the Filter Accept and/or resolving
 *        list.
 * @param Lists Select in which list the device addresses will be added: Filter
 *        Accept List, resolving list or both.
 *        Flags:
 *        - 0x01: Filter Accept List
 *        - 0x02: Resolving List
 * @param Clear_Lists Clear the selected lists before adding the device
 *        addresses.
 *        Values:
 *        - 0x00: Do not clear
 *        - 0x01: Clear before adding
 * @param Num_of_List_Entries Number of devices that have to be added to the
 *        Filter Accept List.
 *        Values:
 *        - 0x00 ... 0xFF
 * @param List_Entry See @ref List_Entry_t
 * @retval Value indicating success or error code.
 */
tBleStatus aci_gap_add_devices_to_filter_accept_and_resolving_list(uint8_t Lists,
                                                                   uint8_t Clear_Lists,
                                                                   uint8_t Num_of_List_Entries,
                                                                   List_Entry_t List_Entry[]);
/**
 * @brief Clear the specified lists and add all bonded devices.
 * @param Lists Select in which list the device addresses will be added: Filter
 *        Accept List, resolving list or both.
 *        Flags:
 *        - 0x01: Filter Accept List
 *        - 0x02: Resolving List
 * @retval Value indicating success or error code.
 */
tBleStatus aci_gap_configure_filter_accept_and_resolving_list(uint8_t Lists);
/**
 * @brief The GAP_Remove_Advertising_Set command is used to remove an
 *        advertising set from the Controller. If the advertising set
 *        corresponding to the Advertising_Handle parameter does not exist, then
 *        the Controller shall return the error code Unknown Advertising
 *        Identifier (0x42). If advertising on the advertising set is enabled,
 *        then the Controller shall return the error code Command Disallowed
 *        (0x0C).
 * @param Advertising_Handle It is used to identify an advertising set
 *        Values:
 *        - 0x00 ... 0xEF: Used to identify an advertising set
 * @retval Value indicating success or error code.
 */
tBleStatus aci_gap_remove_advertising_set(uint8_t Advertising_Handle);
/**
 * @brief The GAP_Clear_Advertising_Sets command is used to remove all existing
 *        advertising sets from the Controller. If advertising is enabled on any
 *        advertising set, then the Controller shall return the error code
 *        Command Disallowed (0x0C). Note: All advertising sets are cleared on
 *        HCI reset.
 * @retval Value indicating success or error code.
 */
tBleStatus aci_gap_clear_advertising_sets(void);
/**
 * @brief This command is used to create a connection between a periodic
 *        advertiser and a synchronized device. See LE Extended Create
 *        Connection [v2] command.
 * @param Advertising_Handle Advertising_Handle identifying the periodic
 *        advertising train.
 *        Values:
 *        - 0x00 ... 0xEF
 *        - 0xFF: Not specified
 * @param Subevent Subevent where the connection request is to be sent.
 *        Values:
 *        - 0x00 ... 0x7F
 *        - 0xFF: Not specified
 * @param Initiator_Filter_Policy The Initiator_Filter_Policy parameter is used
 *        to determine whether the Filter Accept List is used. If the Filter
 *        Accept List is not used, the Peer_Address_Type and the Peer_Address
 *        parameters specify the address type and address of the device to
 *        connect to.  0x00 - Filter Accept List is not used to determine which
 *        device to connect to. Peer_Address_Type and Peer_Address shall be
 *        used. 0x01 - Filter Accept List is used to determine which device to
 *        connect to. Peer_Address_Type and Peer_Address shall be ignored.
 *        Values:
 *        - 0x00: FILTER_ACCEPT_LIST_NOT_USED
 *        - 0x01: FILTER_ACCEPT_LIST_USED
 * @param Own_Address_Type The Own_Address_Type parameter indicates the type of
 *        address being used in the connection request packets.
 *        Values:
 *        - 0x00: Public Device Address
 *        - 0x01: Random Device Address
 *        - 0x02: Controller generates the Resolvable Private Address based on the local
IRK from the resolving list. If the resolving list contains no matching
entry, then use the public address.
 *        - 0x03: Controller generates the Resolvable Private Address based on the local
IRK from the resolving list. If the resolving list contains no matching
entry, then use the random address from the most recent successful
LE_Set_Random_Address Command.
 * @param Peer_Address_Type The Peer_Address_Type parameter indicates the type
 *        of address used in the connectable advertisement sent by the peer.
 *        0x00: Public Device Address or Public Identity Address 0x01: Random
 *        Device Address or Random (static) Identity Address
 *        Values:
 *        - 0x00: Public Address
 *        - 0x01: Random Address
 * @param Peer_Address Public Device Address, Random Device Address, Public
 *        Identity Address, or Random (static) Identity Address of the device to
 *        be connected.
 * @param Connection_Interval_Min Minimum value for the connection interval.
 *        This shall be less than or equal to Connection_Interval_Max. Time = N
 *        x 1.25 ms.
 *        Values:
 *        - 0x0006 ... 0x0C80
 * @param Connection_Interval_Max Maximum value for the connection interval.
 *        This shall be greater than or equal to Connection_Interval_Min.  Time
 *        = N x 1.25 ms
 *        Values:
 *        - 0x0006 ... 0x0C80
 * @param Max_Latency Maximum Peripheral latency for the connection in number of
 *        connection events.
 *        Values:
 *        - 0x0000 ... 0x01F3
 * @param Supervision_Timeout Supervision timeout for the LE Link.  Time = N x
 *        10 ms
 *        Values:
 *        - 0x000A ... 0x0C80
 * @param Min_CE_Length The minimum length of connection event recommended for
 *        this LE connection.
 * @param Max_CE_Length The maximum length of connection event recommended for
 *        this LE connection.
 * @retval Value indicating success or error code.
 */
tBleStatus aci_gap_create_periodic_advertising_connection(uint8_t Advertising_Handle,
                                                          uint8_t Subevent,
                                                          uint8_t Initiator_Filter_Policy,
                                                          uint8_t Own_Address_Type,
                                                          uint8_t Peer_Address_Type,
                                                          uint8_t Peer_Address[6],
                                                          uint16_t Connection_Interval_Min,
                                                          uint16_t Connection_Interval_Max,
                                                          uint16_t Max_Latency,
                                                          uint16_t Supervision_Timeout,
                                                          uint16_t Min_CE_Length,
                                                          uint16_t Max_CE_Length);
/**
 * @brief This command is used by the application to encrypt data used in
 *        advertising packets. The Encrypted_Data will contain the data
 *        formatted as described in Supplement to the Bluetooth Core
 *        Specification, part A, section 1.23 (Encrypted Data), including
 *        Randomizer (5 bytes) and MIC (4 bytes). So, the length of encrypted
 *        data is 9 bytes larger than the length of input data.
 * @param Session_Key
 * @param IV
 * @param Data_Length Length of Data.
 * @param Data Data to be encrypted.
 * @param[out] Encrypted_Data_Length Length of Encrypted_Data.
 * @param[out] Encrypted_Data Encrypted data, including Randomizer (5 bytes) and
 *             MIC (4 bytes).
 * @retval Value indicating success or error code.
 */
tBleStatus aci_gap_encrypt_adv_data_nwk(uint8_t Session_Key[16],
                                        uint8_t IV[8],
                                        uint8_t Data_Length,
                                        uint8_t Data[],
                                        uint8_t *Encrypted_Data_Length,
                                        uint8_t Encrypted_Data[]);
/**
 * @brief Decrypt encrypted advertsing data. The input data must be formatted as
 *        described in Supplement to the Bluetooth Core Specification, part A,
 *        section 1.23 (Encrypted Data), so it must include Randomizer (5 bytes)
 *        and MIC (4 bytes). The decrypted data only contains payload data, i.e.
 *        without Randomizer and MIC.
 * @param Session_Key
 * @param IV
 * @param Encrypted_Data_Length Length of Encrypted_Data.
 * @param Encrypted_Data Encrypted Data, containing Randomizer and MIC.
 * @param[out] Decrypted_Data_Length Length of Decrypted_Data.
 * @param[out] Decrypted_Data Decrypted data, without Randomizer and MIC.
 * @retval Value indicating success or error code.
 */
tBleStatus aci_gap_decrypt_adv_data_nwk(uint8_t Session_Key[16],
                                        uint8_t IV[8],
                                        uint8_t Encrypted_Data_Length,
                                        uint8_t Encrypted_Data[],
                                        uint8_t *Decrypted_Data_Length,
                                        uint8_t Decrypted_Data[]);
/**
     * @}
     */
#endif /* _STM32WB05N_GAP_ACI_H_ */
